==============================
Empty
==============================

return

---

(program (retstat))

==============================
One expression
==============================

return 4

---

(program (retstat (number)))

==============================
Expression list
==============================

return 4, 5, 4

---

(program (retstat (number) (number) (number)))

==============================
Expression list with parens
==============================

return 4, (5), 4

---

(program (retstat (number) (number) (number)))
