==============================
Local Variable Declaration
==============================

local x = 5

---

(program
  (var_declaration (identifier) (number)))

==============================
Global Variable Declaration
==============================

global x = 5

---

(program
  (var_declaration (identifier) (number)))


==============================
Local Variable List Declaration
==============================

local x, y, z = 1, 2, 3

---

(program
  (var_declaration 
    (identifier) (identifier) (identifier)
    (number) (number) (number)))

==============================
Global Variable List Declaration
==============================

global x, y, z = 1, 2, "hey"

---

(program
  (var_declaration 
    (identifier) (identifier) (identifier)
    (number) (number) (string)))


